FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_БытоваяЭлектроника</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ДляДомаИДачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ХоббиИОтдых</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ЗапчастиИАксессуары</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_МотоциклыИМототехника</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ДляБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаДляИзображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ns_ПрисоединенныеФайлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ПрисоединенныеФайлы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("Адрес") Тогда
		ЗаполнитьНаСервере(АдресИзображения, Объект.Наименование, Объект.Расширение, Параметры.Адрес, Параметры.ВыбранноеИмяФайла); 
	КонецЕсли;
	
	Если Объект.ПорядокФайлов = 0 Тогда
		ПоследнийПорядок = Справочники.ns_ПрисоединенныеФайлы.ПолучитьПоследнийПорядокФайла(Объект.ВладелецФайла);
		Объект.ПорядокФайлов = ПоследнийПорядок + 1; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(АдресИзображения, Наименование, Расширение, Адрес, ВыбранноеИмяФайла)
	
	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		УдалитьИзВременногоХранилища(АдресИзображения);	
	КонецЕсли; 
	
	Файл = Новый Файл(ВыбранноеИмяФайла);	
	Наименование = Файл.Имя;
	Расширение = НРег(Файл.Расширение);
	
	Если ns_ОбщегоНазначения.ЭтоГрафическийФайл(Расширение) Тогда
		АдресИзображения = Адрес;
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Наименование) Тогда
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность И ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("АдресФайла", АдресИзображения);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресИзображения = ПолучитьНавигационнуюСсылкуФайла();
КонецПроцедуры

&НаСервере
Функция ПолучитьНавигационнуюСсылкуФайла()
	
	Если ns_ОбщегоНазначения.ЭтоГрафическийФайл(Объект.Расширение) Тогда
		ЗначениеКлюча = Новый Структура;
		ЗначениеКлюча.Вставить("ПрисоединенныйФайл", Объект.Ссылка);
		КлючЗаписи = РегистрыСведений.ns_ПрисоединенныеФайлы.СоздатьКлючЗаписи(ЗначениеКлюча);
		Возврат ПолучитьНавигационнуюСсылку(КлючЗаписи, "Хранилище");
	КонецЕсли; 
	
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ВыбратьДругойФайл(Команда)
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ВыбратьДругойФайлЗавершение", ЭтаФорма),,, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДругойФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		ЗаполнитьНаСервере(АдресИзображения, Объект.Наименование, Объект.Расширение, Адрес, ВыбранноеИмяФайла);
		Модифицированность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	Если ЗначениеЗаполнено(АдресИзображения) Тогда
		ПолучитьФайл(АдресИзображения, СокрЛП(Объект.Наименование) + Объект.Расширение, Истина);
	КонецЕсли;
КонецПроцедуры
